//Напишите программу, которая принимает на вход число и выдаёт количество цифр в числе.

//Напишите программу, которая принимает на вход число N и выдаёт произведение чисел от 1 до N.

//Напишите программу, которая выводит массив из 8 элементов, заполненный нулями и единицами в случайном порядке.[1,0,1,1,0,1,0,0]





//Напишите программу замена элементов массива: положительные элементы замените на соответствующие отрицательные, и наоборот.

//Задайте массив. Напишите программу, которая определяет, присутствует ли заданное число в массиве.

//Задайте одномерный массив из 15 случайных чисел. Найдите количество элементов массива, значения которых лежат в отрезке [10,99].

//Найдите произведение пар чисел в одномерном массиве. Парой считаем первый и последний элемент, второй и предпоследний и т.д. Результат запишите в новом массиве.

/*

